{
  "currentVersion": "2.2.1",
  "history": [
    {
      "version": "2.2.1",
      "date": "2025-12-28",
      "title": "Added login by password and added more questions",
      "changes": [
        "UX: Added option login by password instead of magic link every time",
        "Questions: Added all questions from M24 and M25 subfolder of goddisk, \"Medicine Final MB SAQ By topic up to 2017\". If year of question is unparsable by program, labeled as M55.",
        "Bugfix: Fixed answer inaccuracy in M05-Q13 respiratory medicine question",
        "System: Backend upgrades to solution tracking and progress saving."
      ]
    },
    {
      "version": "2.1.2",
      "date": "2025-12-28",
      "title": "Sort by oldest and suggestions for improvements",
      "changes": [
        "UX: Added option to sort questions by oldest first",
        "Feature: Added suggestion button for users to suggest improvements or new features"
      ]
    },
    {
      "version": "2.1.1",
      "date": "2025-12-28",
      "title": "Confirmation dialog for unmarking question as done",
      "changes": [
        "UX: Unchecking a question as \"Done\" previously wiped your notes instantly. We added a safety confirmation dialog to ensure you never lose your study notes or scores by accident again",
        "System: Backend upgrades to user management and onboarding flows."
      ]
    },
    {
      "version": "2.1.0",
      "date": "2025-12-28",
      "title": "SAQ Improvements & Progress Panel",
      "changes": [
        "Feature: Added progress panel to see progress over all topics at a glance",
        "Feature: Added text input box for Short Answer Questions (SAQ) that saves to DB",
        "Feature: Implemented SAQ point scoring and score tracking",
        "Cosmetics: Question cards now show total marks scored for completed questions",
        "UX: Removed intrusive notes popup for MCQ; Notes button now changes color to indicate if notes exist"
      ]
    },
    {
      "version": "2.0.3",
      "date": "2025-12-27",
      "title": "Add feature to see all notes taken",
      "changes": [
        "Feature: Added Notes panel to see all notes taken in one place, filter by topic and subtopic, as well as expanding card to see original question"
      ]
    },
    {
      "version": "2.0.2",
      "date": "2025-12-27",
      "title": "Add feature to see performance by topic",
      "changes": [
        "Feature: Added stats button to see performance by topic and subtopic",
        "Bugfix: Minor fix to improve progress bar vsuals at the top of the screen"
      ]
    },
    {
      "version": "2.0.1",
      "date": "2025-12-27",
      "title": "Minor AI Fix",
      "changes": [
        "Bugfix: Fixed minor issue with AI analysis not returning results in some cases"
      ]
    },
    {
      "version": "2.0.0",
      "date": "2025-12-26",
      "title": "Questions fix",
      "changes": [
        "Major Update: Added detailed AI analysis if requested using Gemini 2.5 Flash. Better models need money sorry",
        "Feature: Added caching for AI analysis to reduce costs and speed up response time"
      ]
    },
    {
      "version": "1.0.4",
      "date": "2025-12-26",
      "title": "Questions fix",
      "changes": [
        "Questions: Minor fix to questions with incorrectly labeled question type (ie. MCQ vs SAQ)",
        "Announcement: Some questions have no answer. Maybe people remembered the MCQ options incorrectly so no correct answer."
      ]
    },
    {
      "version": "1.0.3",
      "date": "2025-12-26",
      "title": "Added search feature and improved UI",
      "changes": [
        "Feature: Added search function to quickly find a question by specific words",
        "Refactor: Improved UI - collapsable filter menu, show question count in each filter, store filter selections and scroll position"
      ]
    },
    {
      "version": "1.0.2",
      "date": "2025-12-26",
      "title": "Update notes, bug fix, and flag",
      "changes": [
        "Bugfix: on unable to update notes",
        "Feature: Added flag to questions for review later",
        "Feature: Added search function to quickly find a question by specific words",
        "Questions: Added all questions from M25 Superpass. Removed duplicates"
      ]
    },
    {
      "version": "1.0.1",
      "date": "2025-12-26",
      "title": "Version History & Auto-Update",
      "changes": [
        "Added Version History page to track app changes.",
        "Implemented Auto-Update system to force reload on new deployments.",
        "Allow for note taking on questions, record scores achieved for each question."
      ]
    },
    {
      "version": "1.0.0",
      "date": "2025-12-25",
      "title": "Initial Release",
      "changes": [
        "Launched Question Bank with MCQ and SAQ support.",
        "Added all questions from Matthew Cheung superpass",
        "Added filter by Topic and Subtopic, login features to save progress."
      ]
    }
  ]
}